Repository: 1heroo/armstrong-flstck
Catalog: locale/*/LC_MESSAGES/django.po
Languages: ky, ru

source: Modern Armstrong - Kyrgyzstan
ky: Заманбап Armstrong - Кыргызстан
ru: Современные потолочные решения - Кыргызстан

source: Armstrong KG
ky: Armstrong КР
ru: Потолочные решения КГ

source: Home
ky: Башкы бет
ru: Главная

source: Products
ky: Продукция
ru: Продукция

source: Calculator
ky: Калькулятор
ru: Калькулятор

source: Contact
ky: Байланыш
ru: Контакты

source: Search products...
ky: Товарларды издөө...
ru: Поиск товаров...

source: Search Results
ky: Издөөнүн натыйжалары
ru: Результаты поиска

source: Search results for
ky: Издөөнүн натыйжалары
ru: Результаты поиска по запросу

source: Search Products
ru: Поиск товаров

source: Search
ru: Поиск

source: Found:
ky: Табылган:
ru: Найдено:

source: We couldn't find any products matching "%(query)s". Try adjusting your search terms.
ru: Мы не смогли найти товары по запросу "%(query)s". Попробуйте изменить условия поиска.

source: Search suggestions:
ru: Рекомендации по поиску:

source: Check your spelling
ru: Проверьте правописание

source: Try more general terms
ru: Используйте более общие термины

source: Use different keywords
ru: Используйте другие ключевые слова

source: Browse our product categories
ru: Просмотрите наши категории товаров

source: Browse All Products
ru: Просмотреть все товары

source: Search Our Products
ru: Поиск наших товаров

source: Find the perfect ceiling solution by searching through our comprehensive catalog.
ru: Найдите идеальное потолочное решение, выполнив поиск в нашем обширном каталоге.

source: Multi-language Search
ru: Многоязычный поиск

source: Search in English, Russian, or Kyrgyz
ru: Поиск на английском, русском или кыргызском языке

source: Detailed Search
ru: Детальный поиск

source: Search by characteristics and specifications
ru: Поиск по характеристикам и спецификациям

source: Smart Filtering
ru: Умная фильтрация

source: Find products by tags and categories
ru: Поиск товаров по тегам и категориям

source: Welcome to Armstrong.kg world
ru: Добро пожаловать в мир Armstrong.kg

source: High-quality ceiling solutions in Kyrgyzstan for commercial and residential spaces.
ru: Высококачественные потолочные решения в Кыргызстане для коммерческих и жилых помещений.

source: Calculate Your Cost
ru: Рассчитать стоимость

source: View Our Categories
ky: Биздин категорияларды көрүү
ru: Посмотреть категории

source: Our Product Range
ru: Наш ассортимент

source: Full range of Armstrong suspension systems and components. Favorable terms of wholesale deliveries - from small orders to large projects.
ru: Полный ассортимент подвесных систем Armstrong и комплектующих. Выгодные условия оптовых поставок — от небольших заказов до крупных проектов.

source: Learn More
ru: Узнать больше

source: Ready to transform your space?
ru: Готовы преобразить ваше пространство?

source: Get an instant cost estimate for your ceiling project.
ru: Получите мгновенную оценку стоимости вашего потолочного проекта.

source: Get Your Estimate Now
ru: Получите оценку сейчас

source: Where ceilings become space, and space becomes style. Our experience, scale of supply and in-house production form solutions that others follow.
ky: Потолок мейкиндигине, ал эми мейкиндик стилине айланат. Биздин тажрыйбабыз, жеткирүү масштабы жана ички өндүрүш башкаларга ээрчиген чечимдерди түзөт.
ru: Там, где потолки превращаются в пространство, а пространство — в стиль. Наш опыт, масштаб поставок и собственное производство формируют решения, на которые равняются другие.

source: Contact Info
ky: Байланыш маалыматы
ru: Контактная информация

source: Bishkek, Kyrgyzstan
ky: Бишкек, Кыргызстан
ru: Бишкек, Кыргызстан

source: Office Hours
ky: Иш убактысы
ru: Часы работы

source: Monday - Friday: 9:00 - 18:00
ky: Дүйшөмбү - Жума: 9:00 - 18:00
ru: Понедельник - Пятница: 9:00 - 18:00

source: 2025 Armstrong. All rights reserved.
ky: 2025 Armstrong. Бардык укуктар корголгон.
ru: 2025 Armstrong. Все права защищены.

source: Price
ky: Баасы
ru: Цена

source: Description
ky: Сүрөттөмө
ru: Описание

source: Categories
ky: Категориялар
ru: Категории

source: Calculate Cost
ky: Баасын эсептөө
ru: Рассчитать стоимость

source: Get Quote
ky: Баа алуу
ru: Получить предложение

source: Related Products
ky: Байланыштуу продуктылар
ru: Похожие продукты

source: Explore our full range of ceiling solutions.
ky: Потолок чечимдеринин толук ассортиментин изилдеңиз.
ru: Изучите наш полный ассортимент потолочных решений.

source: View All Products
ky: Бардык продуктыларды көрүү
ru: Посмотреть все продукты

source: Get an Instant Cost Estimate
ky: Дароо баа алуу
ru: Получите мгновенную оценку стоимости

source: Calculate your ceiling project cost in seconds. Just enter your room dimensions and select your preferred ceiling type.
ky: Сиздин потолок долбооруңуздун баасын бир нече секундда эсептеңиз. Сиздин бөлмөңүздүн өлчөмдөрүн киргизип, каалаган потолок түрүн тандаңыз.
ru: Рассчитайте стоимость вашего потолочного проекта за считанные секунды. Просто введите размеры вашей комнаты и выберите предпочитаемый тип потолка.

source: Project Details
ky: Долбоордун деталдары
ru: Детали проекта

source: Room Width (meters)
ky: Бөлмөнүн туурасы (метр)
ru: Ширина комнаты (метры)

source: Room Length (meters)
ky: Бөлмөнүн узундугу (метр)
ru: Длина комнаты (метры)

source: Select Ceiling Type
ky: Потолок түрүн тандаңыз
ru: Выберите тип потолка

source: Estimated Cost
ky: Жалпы баа
ru: Ориентировочная стоимость

source: Area
ky: Аянт
ru: Площадь

source: Price per m²
ky: Баасы м² үчүн
ru: Цена за м²

source: Total Cost
ky: Жалпы баа
ru: Общая стоимость

source: This is a preliminary estimate. Final pricing may vary based on specific requirements and installation complexity.
ky: Бул алдын ала баа. Акыркы баа конкреттүү талаптарга жана орнотуу татаалдыгына жараша өзгөрүшү мүмкүн.
ru: Это предварительная оценка. Окончательная цена может варьироваться в зависимости от конкретных требований и сложности установки.

source: Request Detailed Quote
ky: Туура баа сураңыз
ru: Запросить подробное предложение

source: Ready to Start Your Project?
ky: Сиздин долбооруңузду баштоого даярсызбы?
ru: Готовы начать ваш проект?

source: Fill out the form below and our expert will contact you shortly with a detailed quote tailored to your specific needs.
ky: Төмөнкү форманы толтуруңуз, биздин адис сиздин конкреттүү муктаждыктарыңызга ылайык келген так баа менен жакын арада байланышат.
ru: Заполните форму ниже, и наш эксперт свяжется с вами в ближайшее время с подробным предложением, адаптированным к вашим конкретным потребностям.

source: Send us a message
ky: Бизге билдирүү жөнөтүңүз
ru: Отправьте нам сообщение

source: Your Name *
ky: Сиздин атыңыз *
ru: Ваше имя *

source: Phone Number *
ky: Телефон номери *
ru: Номер телефона *

source: Email Address *
ky: Электрондук почта *
ru: Адрес электронной почты *

source: Your Message *
ky: Сиздин билдирүү *
ru: Ваше сообщение *

source: Submit Inquiry
ky: Суранычты жөнөтүү
ru: Отправить запрос

source: Visit Our Office
ky: Биздин кеңсеге барыңыз
ru: Посетите наш офис

source: Call Us
ky: Бизге чалыңыз
ru: Позвоните нам

source: Free consultation
ky: Тегин кеңеш
ru: Бесплатная консультация

source: Email Us
ky: Бизге электрондук почта жөнөтүңүз
ru: Напишите нам

source: Quick response guaranteed
ky: Жылдам жооп кепилденет
ru: Гарантированный быстрый ответ

source: Search products, characteristics, descriptions...
ky: Товарларды, мүнөздөмөлөрдү, сыпаттамаларды издөө...
ru: Поиск товаров, характеристик, описаний...

source: Filter by:
ky: Боюнча чыпкалоо:
ru: Фильтровать по:

source: All
ky: Баары
ru: Все

source: Clear
ky: Тазалоо
ru: Очистить

source: In Stock
ky: Бар
ru: В наличии

source: Out of Stock
ky: Жок
ru: Нет в наличии

source: View Details
ky: Көбүрөөк билүү
ru: Подробнее

source: No products found
ky: Товарлар табылган жок
ru: Товары не найдены

source: Try adjusting your search or filter criteria
ky: Издөө же чыпкалоо критерийлерин өзгөртүп көрүңүз
ru: Попробуйте изменить критерии поиска или фильтрации

source: No products available in this category yet.
ky: Бул категорияда азырынча товарлар жок.
ru: В этой категории пока нет доступных товаров.

source: Please check back later or contact us for more information.
ky: Кийинчерээк кайра текшериңиз же кошумча маалымат үчүн биз менен байланышыңыз.
ru: Пожалуйста, зайдите позже или свяжитесь с нами для получения дополнительной информации.

source: Contact Us
ky: Биз менен байланышыңыз
ru: Связаться с нами

source: Need help choosing the right product?
ky: Туура товарды тандоодо жардам керекпи?
ru: Нужна помощь в выборе подходящего товара?

source: Our experts are ready to help you find the perfect ceiling solution for your project.
ky: Биздин адистер сиздин долбооруңуз үчүн мыкты потолок чечимин табууга жардам берүүгө даяр.
ru: Наши эксперты готовы помочь вам найти идеальное потолочное решение для вашего проекта.

source: Get Estimate
ky: Баасын эсептөө
ru: Рассчитать стоимость

source: Contact Expert
ky: Адис менен байланышуу
ru: Связаться с экспертом

source: About
ky: Жөнүндө
ru: О категории

source: Availability
ky: Жеткиликтүүлүк
ru: Наличие

source: Product Description
ky: Сүрөттөмө
ru: Описание

source: Characteristics
ky: Мүнөздөмөлөр
ru: Характеристики

source: No description available for this product.
ky: Бул товар үчүн сүрөттөмө жок.
ru: Описание для этого товара недоступно.

source: Our Product Categories
ky: Биздин товар категориялары
ru: Наши категории товаров

source: Explore our complete range of ceiling solutions organized by categories
ky: Категориялар боюнча уюштурулган потолок чечимдеринин толук ассортиментин изилдеңиз
ru: Изучите наш полный ассортимент потолочных решений, организованных по категориям

source: Browse Categories
ru: Посмотреть наши категории

source: No categories available at the moment.
ky: Учурда категориялар жеткиликсиз.
ru: В данный момент категории недоступны.

source: Price Range
ky: Баа диапазону
ru: Диапазон цен
